Напишите программу, которая принимает на стандартный вход список игр футбольных команд с результатом матча и выводит на стандартный вывод сводную таблицу результатов всех матчей.

За победу команде начисляется 3 очка, за поражение — 0, за ничью — 1.

Формат ввода следующий:
В первой строке указано целое число nn — количество завершенных игр.
После этого идет nn строк, в которых записаны результаты игры в следующем формате:
Первая_команда;Забито_первой_командой;Вторая_команда;Забито_второй_командой

Вывод программы необходимо оформить следующим образом:
Команда:Всего_игр Побед Ничьих Поражений Всего_очков

Конкретный пример ввода-вывода приведён ниже.

Порядок вывода команд произвольный.

**Sample Input:**

3

Спартак;9;Зенит;10

Локомотив;12;Зенит;3

Спартак;8;Локомотив;15

**Sample Output:**

Спартак:2 0 0 2 0

Зенит:2 1 0 1 3

Локомотив:2 2 0 0 6

**Solution / Решение**
```
n = int(input())
list_of_games = []
for i in range(n):
    i = list(input().split(';'))
    list_of_games.append(i)
    
results = {}
a = 'A'
for i in list_of_games:
    for j in i:
        if j > a and j not in results.keys():
            results[j] = [0, 0, 0, 0, 0]

cnt = 0
a = 'A'
while cnt != n:
    for i in list_of_games[cnt]:
        if i > a:
            for key in results.keys():
                if i == key and i == list_of_games[cnt][0]:
                    if int(list_of_games[cnt][1]) > int(list_of_games[cnt][3]):
                        results[key][0] += 1
                        results[key][1] += 1
                        results[key][4] += 3
                        break
                    elif int(list_of_games[cnt][1]) == int(list_of_games[cnt][3]):
                        results[key][0] += 1
                        results[key][2] += 1
                        results[key][4] += 1
                        break
                    else:
                        results[key][0] += 1
                        results[key][3] += 1
                        break
                elif i == key and i == list_of_games[cnt][2]:
                    if int(list_of_games[cnt][3]) > int(list_of_games[cnt][1]):
                        results[key][0] += 1
                        results[key][1] += 1
                        results[key][4] += 3
                        break
                    elif int(list_of_games[cnt][3]) == int(list_of_games[cnt][1]):
                        results[key][0] += 1
                        results[key][2] += 1
                        results[key][4] += 1
                        break
                    else:
                        results[key][0] += 1
                        results[key][3] += 1
                        break
    cnt+=1
for key, value in results.items():
    str1 = ' '.join(str(e) for e in value) 
    print(key + ':' + str1)
```
