В какой-то момент в Институте биоинформатики биологи перестали понимать, что говорят информатики: они говорили каким-то странным набором звуков.

В какой-то момент один из биологов раскрыл секрет информатиков: они использовали при общении <a href="https://ru.wikipedia.org/wiki/%D0%A8%D0%B8%D1%84%D1%80_%D0%BF%D0%BE%D0%B4%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BA%D0%B8">подстановочный шифр</a>, т.е. заменяли каждый символ исходного сообщения на соответствующий ему другой символ. Биологи раздобыли ключ к шифру и теперь нуждаются в помощи:

Напишите программу, которая умеет шифровать и расшифровывать шифр подстановки. Программа принимает на вход две строки одинаковой длины, на первой строке записаны символы исходного алфавита, на второй строке — символы конечного алфавита, после чего идёт строка, которую нужно зашифровать переданным ключом, и ещё одна строка, которую нужно расшифровать.

Пусть, например, на вход программе передано:

abcd

*d%#

abacabadaba

#*%*d*%


Это значит, что символ a исходного сообщения заменяется на символ * в шифре, b заменяется на d, c — на % и d — на #.
Нужно зашифровать строку abacabadaba и расшифровать строку #*%*d*% с помощью этого шифра. Получаем следующие строки, которые и передаём на вывод программы:
*d*%*d*#*d*
dacabac

**Sample Input 1:**

abcd

*d%#

abacabadaba

#*%*d*%

**Sample Output 1:**

*d*%*d*#*d*

dacabac

**Sample Input 2:**

dcba

badc

dcba

badc

**Sample Output 2:**

badc

dcba

**Solution / Решение**

```
a = str(input())
b = str(input())
s = str(input())
ss = str(input())
s1 = ''
s2 = ''
d = {}
cnt = 0
for i in a:
    if i not in d:
        d[i] = b[cnt]
    else:
        continue
    cnt += 1
for i in s:
    for key in d.keys():
        if i == key:
            s1 += d.get(key)
            break
print(s1)
for i in ss:
    for key, value in d.items():
        if i == value:
            s2 += key
            break
print(s2)
```
